esp8266/Arduino/boards.txt
##############################################################
# wifio.name=Wifio
#
# wifio.upload.tool=esptool
# wifio.upload.speed=115200
# wifio.upload.resetmethod=wifio
# wifio.upload.maximum_size=524288
# wifio.upload.wait_for_upload_port=true
#
# wifio.build.mcu=esp8266
# wifio.build.f_cpu=80000000L
# wifio.build.board=ESP8266_WIFIO
# wifio.build.core=esp8266
# wifio.build.variant=wifio
# wifio.build.flash_mode=qio
# wifio.build.flash_size=512K
# wifio.build.flash_freq=40
# wifio.build.flash_ld=eagle.flash.512k64.ld
# wifio.build.spiffs_start=0x6B000
# wifio.build.spiffs_end=0x7B000
#
# wifio.menu.CpuFrequency.80=80MHz
# wifio.menu.CpuFrequency.80.build.f_cpu=80000000L
# wifio.menu.CpuFrequency.160=160MHz
# wifio.menu.CpuFrequency.160.build.f_cpu=160000000L
#
# wifio.upload.tool=esptool
#

##############################################################
d1.name=WeMos D1

d1.upload.tool=esptool
d1.upload.speed=460800
d1.upload.resetmethod=ck
d1.upload.maximum_size=1044464
d1.upload.maximum_data_size=81920
d1.upload.wait_for_upload_port=true
d1.serial.disableDTR=true
d1.serial.disableRTS=true

d1.build.mcu=esp8266
d1.build.f_cpu=80000000L
d1.build.board=ESP8266_ESP12
d1.build.core=esp8266
d1.build.variant=d1
d1.build.flash_mode=dio
d1.build.flash_size=4M
d1.build.flash_freq=40
d1.build.flash_ld=eagle.flash.4m.ld
d1.build.spiffs_start=0x100000
d1.build.spiffs_end=0x3FB000
d1.build.spiffs_pagesize=256
d1.build.spiffs_blocksize=8192

d1.menu.UploadTool.esptool=Serial
d1.menu.UploadTool.esptool.upload.tool=esptool
d1.menu.UploadTool.espota=OTA
d1.menu.UploadTool.espota.upload.tool=espota

d1.menu.CpuFrequency.80=80 MHz
d1.menu.CpuFrequency.80.build.f_cpu=80000000L
d1.menu.CpuFrequency.160=160 MHz
d1.menu.CpuFrequency.160.build.f_cpu=160000000L

d1.menu.UploadSpeed.460800=460800
d1.menu.UploadSpeed.460800.upload.speed=460800
d1.menu.UploadSpeed.115200=115200
d1.menu.UploadSpeed.115200.upload.speed=115200
d1.menu.UploadSpeed.9600=9600
d1.menu.UploadSpeed.9600.upload.speed=9600
d1.menu.UploadSpeed.57600=57600
d1.menu.UploadSpeed.57600.upload.speed=57600
d1.menu.UploadSpeed.256000.windows=256000
d1.menu.UploadSpeed.256000.upload.speed=256000
d1.menu.UploadSpeed.230400.linux=230400
d1.menu.UploadSpeed.230400.macosx=230400
d1.menu.UploadSpeed.230400.macosx=230400
d1.menu.UploadSpeed.230400.upload.speed=230400
d1.menu.UploadSpeed.512000.windows=512000
d1.menu.UploadSpeed.512000.upload.speed=512000
d1.menu.UploadSpeed.921600=921600
d1.menu.UploadSpeed.921600.upload.speed=921600
##############################################################
d1mini.name=WeMos D1 mini

d1mini.upload.tool=esptool
d1mini.upload.speed=460800
d1mini.upload.resetmethod=ck
d1mini.upload.maximum_size=1044464
d1mini.upload.maximum_data_size=81920
d1mini.upload.wait_for_upload_port=true
d1mini.serial.disableDTR=true
d1mini.serial.disableRTS=true

d1mini.build.mcu=esp8266
d1mini.build.f_cpu=80000000L
d1mini.build.board=ESP8266_ESP12
d1mini.build.core=esp8266
d1mini.build.variant=d1_mini
d1mini.build.flash_mode=dio
d1mini.build.flash_size=4M
d1mini.build.flash_freq=40
d1mini.build.flash_ld=eagle.flash.4m.ld
d1mini.build.spiffs_start=0x100000
d1mini.build.spiffs_end=0x3FB000
d1mini.build.spiffs_pagesize=256
d1mini.build.spiffs_blocksize=8192

d1mini.menu.UploadTool.esptool=Serial
d1mini.menu.UploadTool.esptool.upload.tool=esptool
d1mini.menu.UploadTool.espota=OTA
d1mini.menu.UploadTool.espota.upload.tool=espota

d1mini.menu.CpuFrequency.80=80 MHz
d1mini.menu.CpuFrequency.80.build.f_cpu=80000000L
d1mini.menu.CpuFrequency.160=160 MHz
d1mini.menu.CpuFrequency.160.build.f_cpu=160000000L

d1mini.menu.UploadSpeed.460800=460800
d1mini.menu.UploadSpeed.460800.upload.speed=460800
d1mini.menu.UploadSpeed.115200=115200
d1mini.menu.UploadSpeed.115200.upload.speed=115200
d1mini.menu.UploadSpeed.9600=9600
d1mini.menu.UploadSpeed.9600.upload.speed=9600
d1mini.menu.UploadSpeed.57600=57600
d1mini.menu.UploadSpeed.57600.upload.speed=57600
d1mini.menu.UploadSpeed.256000.windows=256000
d1mini.menu.UploadSpeed.256000.upload.speed=256000
d1mini.menu.UploadSpeed.230400.linux=230400
d1mini.menu.UploadSpeed.230400.macosx=230400
d1mini.menu.UploadSpeed.230400.macosx=230400
d1mini.menu.UploadSpeed.230400.upload.speed=230400
d1mini.menu.UploadSpeed.512000.windows=512000
d1mini.menu.UploadSpeed.512000.upload.speed=512000
d1mini.menu.UploadSpeed.921600=921600
d1mini.menu.UploadSpeed.921600.upload.speed=921600
